//z1
alert(60*60*24);
//z2
let d1=prompt('введите количество дней');
alert('колличество секунд в'+d1+'='+'днях'+3600*24*d1);
//z3
alert('кол-во секунд в году'+3600*24*365);
//z4
alert('кол-во минут в сутках'+60*24);
//z5
alert('кол-во минут в году'+60*24*365);
//z6
alert('кол-во байт в мегабайте'+1024*1024);
//z7
alert('кол-во байт в гигабайте'+1024*1024*1024);
//z8
let g1=prompt('введите кол-во гигабайт');
alert('колличество байт в '+g1+'гигабайтах'+'='+1024*1024*1024*g1);
//z9
alert('кол-во байт в терабайте'+1024*1024*1024*1024);
//z10
alert('кол-во килло байт в терабайте = '+1024*1024*1024);