let r=prompt('введите радиус круга');
let s=Number(r)*Number(r)*2*3.14;
alert('площадь круга равана: '+s);


//z2
let a=prompt('введите сторону квадрата');
alert('площадь квадрата равана: '+Number(a)*Number(a));


//z3
let f1=prompt('введите сторону прямоугольника')
let f2=prompt('введите сторону прямоугольника')
let S=Number(f1)*Number(f2);
alert('площадь квадрата равана: '+S);


//z4
let f3=prompt('введите сторону прямоугольника')
let f4=prompt('введите сторону прямоугольника')
let S1=Number(f1)*2+Number(f2)*2;
alert('площадь прямоугольника равана: '+S1);

//z5
let tc1=prompt('введите градусы в цельсиях')
let fr=9/5*Number(tc1)+32;
alert('температура в фаренгейтах равна: '+fr);

//z6
let tc2=prompt('введите градусы в фаренгейтах')
let fr1=9/5*(Number(tc2)-32);
alert('температура в цельсии равна: '+fr1);